{
  "objective": "Project Brief: MVP voor Cursusplatform 'GroeimetAI Platform'\n\n### 1. Core Mission\nOntwikkel de Minimum Viable Product (MVP) van een e-learning platform gericht op praktische, tekst-en-beeld gebaseerde trainingen over Generative AI en automatiseringstools voor de Nederlandse professionele markt. De focus ligt op direct toepasbare kennis van de tools en strategieën.\n\n### 2. User Roles & Core Journeys (MVP)\nImplementeer de volgende twee gebruikerstypen met hun kernfunctionaliteiten:\n\n**a) Student:**\n- Kan een account aanmaken en inloggen (social & e-mail).\n- Kan de cursuscatalogus bekijken.\n- Kan een individuele cursus kopen via een betaalprovider.\n- Heeft een persoonlijk dashboard met een overzicht van gevolgde cursussen en voortgang.\n- Kan een cursus volgen (lessen bekijken, assessments maken).\n- Kan na het behalen van een assessment (min. 80% score) een digitaal certificaat genereren (met QR-code verificatie).\n- Kan het certificaat delen op LinkedIn.\n\n**b) Admin:**\n- Heeft volledige CRUD (Create, Read, Update, Delete) toegang tot cursussen, lessen en assessments.\n- Kan gebruikers beheren.\n- Kan de kwaliteit van de content waarborgen.\n\n### 3. Key Features for MVP\nOntwikkel de volgende kernonderdelen:\n- **Homepage/Cursuscatalogus:** Een overzicht van alle beschikbare cursussen.\n- **Cursus Detailpagina:** Gedetailleerde informatie per cursus, inclusief inhoudsopgave, prijs en leerdoelen.\n- **Gebruikersauthenticatie:** Veilig inloggen en registreren.\n- **Betalingsintegratie:** Afhandelen van eenmalige cursus aankopen.\n- **Persoonlijk Dashboard:** Overzicht van de voortgang van de student.\n- **Les-interface:** Een schone interface voor het weergeven van lessen met tekst, afbeeldingen, grafieken en code snippets.\n- **Assessment Module:** Systeem voor het afnemen van multiple-choice of open vragen.\n- **Certificeringsmodule:** Genereren en valideren van certificaten.\n- **Admin Panel:** Een backend interface voor content- en gebruikersbeheer.\n\n### 4. Tech Stack\n- **Frontend:** Next.js\n- **UI:** Shadcn/ui\n- **Authenticatie:** Firebase Authentication\n- **Hosting:** Google Cloud Platform (Cloud Run)\n- **Database/Storage:** Firestore / Cloud Storage (voor afbeeldingen en certificaten)\n- **Betalingen:** Mollie (focus op eenmalige betalingen, geen split payments in MVP)\n\n### 5. Belangrijke MVP-Scope (Wat we **niet** bouwen)\nDe volgende features worden expliciet **uitgesloten** van de MVP om de focus te behouden:\n- **GEEN** video hosting of streaming implementatie. Content is tekst, afbeeldingen en grafieken.\n- **GEEN** publiek-toegankelijke 'Docent' rol met eigen course builder of analytics. Admins maken de initiële content.\n- **GEEN** subscription-modellen. Alleen eenmalige aankopen.\n- **GEEN** community forums, peer reviews, of live Q&A-functionaliteit.\n- **GEEN** plagiaatdetectie.\n- **GEEN** mobile app.\n\n### 6. Einddoel voor de Swarm\nGenereer de volledige projectstructuur, definieer de datamodellen voor Firestore, en ontwikkel de front-end en back-end componenten voor de hierboven beschreven MVP van het GroeimetAI Platform.",
  "strategy": "auto",
  "mode": "hierarchical",
  "maxAgents": 5,
  "timeout": 60,
  "parallel": true,
  "monitor": true,
  "output": "json",
  "outputDir": "./reports",
  "timestamp": "2025-06-25T20:35:19.718Z",
  "id": "swarm-auto-hierarchical-1750883719719"
}